Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 600, 1)]     0                                            
__________________________________________________________________________________________________
conv1d (Conv1D)                 (None, 596, 32)      192         input_1[0][0]                    
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 596, 32)      5152        conv1d[0][0]                     
__________________________________________________________________________________________________
re_lu (ReLU)                    (None, 596, 32)      0           conv1d_1[0][0]                   
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, 596, 32)      5152        re_lu[0][0]                      
__________________________________________________________________________________________________
add (Add)                       (None, 596, 32)      0           conv1d[0][0]                     
                                                                 conv1d_2[0][0]                   
__________________________________________________________________________________________________
re_lu_1 (ReLU)                  (None, 596, 32)      0           add[0][0]                        
__________________________________________________________________________________________________
max_pooling1d (MaxPooling1D)    (None, 296, 32)      0           re_lu_1[0][0]                    
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, 296, 32)      5152        max_pooling1d[0][0]              
__________________________________________________________________________________________________
re_lu_2 (ReLU)                  (None, 296, 32)      0           conv1d_3[0][0]                   
__________________________________________________________________________________________________
conv1d_4 (Conv1D)               (None, 296, 32)      5152        re_lu_2[0][0]                    
__________________________________________________________________________________________________
add_1 (Add)                     (None, 296, 32)      0           max_pooling1d[0][0]              
                                                                 conv1d_4[0][0]                   
__________________________________________________________________________________________________
re_lu_3 (ReLU)                  (None, 296, 32)      0           add_1[0][0]                      
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, 146, 32)      0           re_lu_3[0][0]                    
__________________________________________________________________________________________________
conv1d_5 (Conv1D)               (None, 146, 32)      5152        max_pooling1d_1[0][0]            
__________________________________________________________________________________________________
re_lu_4 (ReLU)                  (None, 146, 32)      0           conv1d_5[0][0]                   
__________________________________________________________________________________________________
conv1d_6 (Conv1D)               (None, 146, 32)      5152        re_lu_4[0][0]                    
__________________________________________________________________________________________________
add_2 (Add)                     (None, 146, 32)      0           max_pooling1d_1[0][0]            
                                                                 conv1d_6[0][0]                   
__________________________________________________________________________________________________
re_lu_5 (ReLU)                  (None, 146, 32)      0           add_2[0][0]                      
__________________________________________________________________________________________________
max_pooling1d_2 (MaxPooling1D)  (None, 71, 32)       0           re_lu_5[0][0]                    
__________________________________________________________________________________________________
conv1d_7 (Conv1D)               (None, 71, 32)       5152        max_pooling1d_2[0][0]            
__________________________________________________________________________________________________
re_lu_6 (ReLU)                  (None, 71, 32)       0           conv1d_7[0][0]                   
__________________________________________________________________________________________________
conv1d_8 (Conv1D)               (None, 71, 32)       5152        re_lu_6[0][0]                    
__________________________________________________________________________________________________
add_3 (Add)                     (None, 71, 32)       0           max_pooling1d_2[0][0]            
                                                                 conv1d_8[0][0]                   
__________________________________________________________________________________________________
re_lu_7 (ReLU)                  (None, 71, 32)       0           add_3[0][0]                      
__________________________________________________________________________________________________
max_pooling1d_3 (MaxPooling1D)  (None, 34, 32)       0           re_lu_7[0][0]                    
__________________________________________________________________________________________________
conv1d_9 (Conv1D)               (None, 34, 32)       5152        max_pooling1d_3[0][0]            
__________________________________________________________________________________________________
re_lu_8 (ReLU)                  (None, 34, 32)       0           conv1d_9[0][0]                   
__________________________________________________________________________________________________
conv1d_10 (Conv1D)              (None, 34, 32)       5152        re_lu_8[0][0]                    
__________________________________________________________________________________________________
add_4 (Add)                     (None, 34, 32)       0           max_pooling1d_3[0][0]            
                                                                 conv1d_10[0][0]                  
__________________________________________________________________________________________________
re_lu_9 (ReLU)                  (None, 34, 32)       0           add_4[0][0]                      
__________________________________________________________________________________________________
max_pooling1d_4 (MaxPooling1D)  (None, 15, 32)       0           re_lu_9[0][0]                    
__________________________________________________________________________________________________
flatten (Flatten)               (None, 480)          0           max_pooling1d_4[0][0]            
__________________________________________________________________________________________________
dense (Dense)                   (None, 32)           15392       flatten[0][0]                    
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 32)           1056        dense[0][0]                      
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 2)            66          dense_1[0][0]                    
==================================================================================================
Total params: 68,226
Trainable params: 68,226
Non-trainable params: 0
__________________________________________________________________________________________________
